tsung/flow1-2.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='15000'/>
  </clients>

  <!-- Server side setup -->
  <servers>
    <server host="localhost" port="3000" type="tcp"></server>
  </servers>

  <load>
    <arrivalphase phase="1" duration="5" unit="second">
      <users arrivalrate="16" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="2" duration="1" unit="minute">
      <users arrivalrate="32" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="3" duration="1" unit="minute">
      <users arrivalrate="64" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="4" duration="1" unit="minute">
      <users arrivalrate="128" unit="second"></users>
    </arrivalphase>
  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

  <sessions>
    <session name="Item Index" probability="50" type="ts_http">
      <!-- Set dynamic variable for use in item viewing request -->
      <setdynvars sourcetype="random_number" start="1" end="1000">
        <var name="rndint" />
      </setdynvars>

      <!-- Visit homepage -->
      <request><http url='/' version='1.1' method='GET'/></request>

      <!-- Visit items page -->
      <request><http url='/items' version='1.1' method='GET'/></request>

      <!-- Wait to simulate user looking around -->
      <thinktime value="1" random="false"/>

      <!-- Select random item from item page (we know we generate ~8000 items) -->
      <request subst="true">
        <dyn_variable name="rndint"/>
        <http url="/items/%%_rndint%%"/>
      </request>
    </session>

    <session name="Item Creation" probability="50" type="ts_http">

      <setdynvars sourcetype="random_number" start="2" end="100">
        <var name="random_user_number" />
      </setdynvars>

      <request>
        <http url='/' version='1.1' method='GET'></http>
      </request>

      <request subst="true">
        <http url='/login' version='1.1' method='POST'
              contents="session[email]=user%%_random_user_number%%@example.com&amp;
                          session[password]=foobar&amp;"
              content_type="application/x-www-form-urlencoded" />
      </request>

      <request>
        <http url='/items' version='1.1' method='POST'
              contents="item[title]=Tsung-item&amp;
                        item[description]=description&amp;
                        item[category_id]=1&amp;
                        item[price_hourly_usd]=5&amp;
                        condition=Good&amp;
                        commit=Create Item"
              content_type="application/x-www-form-urlencoded" />
      </request>

      <request>
        <http url='/logout' version='1.1' method='DELETE'></http>
      </request>
    </session>
  </sessions>
</tsung>